In [1]:
library(sqldf)

Flights <- data.frame(
  flight_id = c(1, 2, 3),
  airline = c("AA", "DL", "UA"),
  origin = c("JFK", "ATL", "ORD"),
  destination = c("LAX", "SFO", "MIA"),
  departure_time = c("2024-06-01 08:00:00", "2024-06-01 09:30:00", "2024-06-01 07:00:00"),
  arrival_time = c("2024-06-01 11:00:00", "2024-06-01 12:00:00", "2024-06-01 11:30:00"),
  flight_duration = c(6.0, 5.5, 3.5),
  distance = c(2475, 2139, 1197),
  price = c(300, 350, 200)
)

Airports <- data.frame(
  airport_code = c("JFK", "LAX", "ATL", "SFO", "ORD", "MIA"),
  airport_name = c("John F. Kennedy Intl", "Los Angeles Intl", "Hartsfield-Jackson",
                   "San Francisco Intl", "O'Hare Intl", "Miami Intl"),
  city = c("New York", "Los Angeles", "Atlanta", "San Francisco", "Chicago", "Miami"),
  state = c("NY", "CA", "GA", "CA", "IL", "FL"),
  country = rep("USA", 6)
)

result <- sqldf("SELECT airline, origin, price FROM Flights;")
print(result)

Warning message:
"package 'sqldf' was built under R version 4.4.3"
Loading required package: gsubfn

Warning message:
"package 'gsubfn' was built under R version 4.4.3"
Loading required package: proto

Warning message:
"package 'proto' was built under R version 4.4.3"
Loading required package: RSQLite

Warning message:
"package 'RSQLite' was built under R version 4.4.3"

  airline origin price
1      AA    JFK   300
2      DL    ATL   350
3      UA    ORD   200

In [2]:
Flights

  flight_id airline origin destination departure_time      arrival_time
1 1         AA      JFK    LAX         2024-06-01 08:00:00 2024-06-01 11:00:00
2 2         DL      ATL    SFO         2024-06-01 09:30:00 2024-06-01 12:00:00
3 3         UA      ORD    MIA         2024-06-01 07:00:00 2024-06-01 11:30:00
  flight_duration distance price
1 6.0             2475     300
2 5.5             2139     350
3 3.5             1197     200

In [7]:
sqldf("
  SELECT f.flight_id, a1.airport_name AS origin, a2.airport_name AS destination
  FROM Flights f
  JOIN Airports a1 ON f.origin = a1.airport_code
  JOIN Airports a2 ON f.destination = a2.airport_code
")

  flight_id origin               destination
1 1         John F. Kennedy Intl Los Angeles Intl
2 2         Hartsfield-Jackson   San Francisco Intl
3 3         O'Hare Intl          Miami Intl

In [6]:
sqldf("SELECT AVG(price) AS average_price FROM Flights")

  average_price
1 283.3333

In [20]:
sqldf("SELECT origin, COUNT(*) AS num_flights FROM Flights GROUP BY origin")

  origin num_flights
1 ATL    1
2 JFK    1
3 ORD    1

In [24]:
sqldf("SELECT 
  f.flight_id,
  a1.airport_name AS origin_airport,
  a2.airport_name AS destination_airport
FROM Flights f
JOIN Airports a1 ON f.origin = a1.airport_code
JOIN Airports a2 ON f.destination = a2.airport_code;")

  flight_id origin_airport       destination_airport
1 1         John F. Kennedy Intl Los Angeles Intl
2 2         Hartsfield-Jackson   San Francisco Intl
3 3         O'Hare Intl          Miami Intl

In [27]:
sqldf("SELECT * from Flights")

  flight_id airline origin destination departure_time      arrival_time
1 1         AA      JFK    LAX         2024-06-01 08:00:00 2024-06-01 11:00:00
2 2         DL      ATL    SFO         2024-06-01 09:30:00 2024-06-01 12:00:00
3 3         UA      ORD    MIA         2024-06-01 07:00:00 2024-06-01 11:30:00
  flight_duration distance price
1 6.0             2475     300
2 5.5             2139     350
3 3.5             1197     200

In [39]:
sqldf("SELECT * FROM Flights WHERE airline = 'AA';")

  flight_id airline origin destination departure_time      arrival_time
1 1         AA      JFK    LAX         2024-06-01 08:00:00 2024-06-01 11:00:00
  flight_duration distance price
1 6               2475     300